{
    "version": "https://jsonfeed.org/version/1",
    "title": "UMBC Catacomb Research Center",
    "description": "",
    "home_page_url": "https://theultimateabsol.github.io/catacombs",
    "feed_url": "https://theultimateabsol.github.io/catacombs/feed.json",
    "user_comment": "",
    "author": {
        "name": "anonymous"
    },
    "items": [
        {
            "id": "https://theultimateabsol.github.io/catacombs/ancient-vending-machine-discovered-stocked-with-pepsi.html",
            "url": "https://theultimateabsol.github.io/catacombs/ancient-vending-machine-discovered-stocked-with-pepsi.html",
            "title": "Ancient Vending Machine discovered; stocked with Pepsi",
            "summary": "UMBC, a college founded on September 19th, 1966, typically is known to&hellip;",
            "content_html": "<p>UMBC, a college founded on September 19th, 1966, typically is known to satisfy their thirsty students with an ice cold Coca-cola. But was this always the case?</p>\n<p>Recently a group of students have unearthed a <span style=\"text-decoration: underline;\"><strong>20</strong></span> year old vending machine in the bottom of the Fine Arts building, with options for Pepsi, Diet Pepsi, and even Crush.</p>\n<p>\"I don't know how we never noticed it, it was literally on the base level,\" one student testified.</p>\n<p>\"No one even has classes down there.\" Another student added.</p>\n<p>We tried reaching out to UMBC staff to know if they were aware of such a blastphemous machine. They declined to comment.</p>",
            "image": "https://theultimateabsol.github.io/catacombs/media/posts/4/pepsi-2.jpg",
            "author": {
                "name": "anonymous"
            },
            "tags": [
            ],
            "date_published": "2022-06-04T04:42:00-04:00",
            "date_modified": "2022-06-21T04:54:20-04:00"
        },
        {
            "id": "https://theultimateabsol.github.io/catacombs/math-students-disappearing-after-supposed-trips-to-the-bathroom.html",
            "url": "https://theultimateabsol.github.io/catacombs/math-students-disappearing-after-supposed-trips-to-the-bathroom.html",
            "title": "Math Students Disappearing after supposed &quot;trips to the bathroom&quot;",
            "summary": "4/21/2022, 12:15 PM. Math/Psyc building restrooms are put under maintenance. An announcement&hellip;",
            "content_html": "<p>4/21/2022, 12:15 PM. Math/Psyc building restrooms are put under maintenance. An announcement is put on the myUMBC website.</p>\n<p>4/21/2022, 1:00 PM. Alice is seen running away from the 104 classroom. Seemingly unaware of the announcement, she walks towards the Math building bathroom. It is locked. She walks down the stairs to the lower level to cross over to the Psyc building. However, footage of the Psyc building shows no signs of Alice.</p>\n<p>4/21/2022, 8:15 PM. A search party of 7 is sent to find Alice.</p>\n<p>4/21/2022, 9:15 PM. Still no contact from the search party.</p>\n<p>4/22/2022, 3:02 AM. I receive a phone call from one of the search party members. However, it is cut off before I can answer.</p>\n<p>4/22/2022, 7:00 AM. A heavy thunderstorm rolls in. Students are encouraged to stay indoors.</p>\n<p>4/22/2022, 9:50 AM.  4 students leave room MATH 102 and walk towards the Psyc building. Teacher reports these students missing on the attendance sheet.</p>\n<p>4/22/2022, 12:15 PM. The JSA holds their weekly board meeting in room 015 of Sondheim. 8 of their regular members are missing, and the meeting is canceled.</p>\n<p>4/22/2022, 3:12 PM. The storm has escalated to a Tornado Warning. Students are dismissed early from their classes</p>\n<p>4/22/2022, 4:00 PM. Reports of a Tornado touchdown near i-95 surface. An emergency siren goes off around campus, and students are told to immediately shelter in place.</p>\n<p>4/22/2022, 4:02 PM. A group of ten students rush underground in the space between the Math/Psyc and Sonheim buildings to take cover</p>\n<p>4/22/2022, 4:15 PM. The storm starts to subside. The shelter-in-place order is rescinded.</p>\n<p>4/22/2022, 5:03 PM. The 10 students who sought shelter are still nowhere to be found.</p>\n<p><span style=\"text-decoration: underline;\"><strong>30</strong></span> students have gone missing in the past 48 hours. I cannot explain why. It seems that the root cause lies underground between the Math/Psyc and Sonheim buildings.</p>",
            "image": "https://theultimateabsol.github.io/catacombs/media/posts/3/Picture2.jpg",
            "author": {
                "name": "anonymous"
            },
            "tags": [
            ],
            "date_published": "2022-06-03T03:22:00-04:00",
            "date_modified": "2022-06-21T04:54:28-04:00"
        },
        {
            "id": "https://theultimateabsol.github.io/catacombs/demon-sighting-on-engineering-building-steps.html",
            "url": "https://theultimateabsol.github.io/catacombs/demon-sighting-on-engineering-building-steps.html",
            "title": "Demon Sighting on Engineering Building Steps",
            "summary": "The following was caught on security cam footage around campus. It was&hellip;",
            "content_html": "<p>The following was caught on security cam footage around campus.</p>\n<p>It was a dark, quiet night. All but the lights between the Psyc building and Myerhoff had gone dark. Not a soul was in sight, but the winds still howled through the buildings like a wind tunnel that we all knew so well.</p>\n<p>A 421 student, having just recompiled his kernel for the 16<sup>th</sup> time, wandered out of the doors of the Engineering building. Was it the middle of the night? Or would dawn soon come? No matter, he trudged on hoping that he could soon find his bed and forget about the endless frustration he has endured.</p>\n<p>He hopped down the steps towards Sondheim. One. Two. Three. Five. His balance was off. His conscience was falling, falling, falling. Seven. Eleven. Twelve. Lighter and lighter his steps got until finally he was weightless – falling – and suddenly, pulled back like a rubber band, he hit ground.</p>\n<p>To his left was the Chick fil A. To his right were the picnic tables. Picking himself back up for another round of stairs, the student trudges on. But as he moves, a shadowy figure hovers over the tables. Unaware, the student trudges on. That shadowy figure multiplies. One table. Two tables. Three Tables. A sea of <span style=\"text-decoration: underline;\"><strong>Twenty</strong></span> shadowy figuresswarms the tables leaving a sight impossible to ignore. The unexpected sight catches the corner of the student’s eye.</p>\n<p>The figures, in unison, stop and turn towards the student. The student looks at the figures. In disbelief, the student turns around in the other direction, towards the restaurant once open, now closed. The student turns back once more to confirm that this wasn’t just his tired imagination…</p>\n<p>… To face an attack swarm of <strong><span style=\"text-decoration: underline;\">twenty</span></strong> hungry demons devoid of waffle fries and Polynesian sauce</p>",
            "image": "https://theultimateabsol.github.io/catacombs/media/posts/1/small-flying-squirrel.webp",
            "author": {
                "name": "anonymous"
            },
            "tags": [
            ],
            "date_published": "2022-06-02T02:10:00-04:00",
            "date_modified": "2022-06-21T04:54:46-04:00"
        },
        {
            "id": "https://theultimateabsol.github.io/catacombs/strange-moans-from-locker-28.html",
            "url": "https://theultimateabsol.github.io/catacombs/strange-moans-from-locker-28.html",
            "title": "Strange Moans from Locker 28",
            "summary": "A part time worker at the Game Room has reported strange moanings&hellip;",
            "content_html": "<p>A part time worker at the Game Room has reported strange moanings coming from the Student Orgs room.</p>\n<p>This report has been verified with several students working at flat tuesdays hoping that maybe one day it would reopen.</p>\n<p>We also got some complaints from the Mosaic. But they also complain a lot so we usually shrug it off.</p>\n<p>Triangulating the sources however, it appears that the source of these moans is coming from <span style=\"text-decoration: underline;\"><strong>locker 28</strong></span>.</p>\n<p>Why that locker? No one knows. When interviewing several bystanders, we got mixed results:</p>\n<p>\"No one's ever used that locker!\"</p>\n<p>\"I hear that locker belonged to that construction worker that fell off the commons rooftop\"</p>\n<p>\"It's probably someone crying in the mosaic safe space again\"</p>\n<p>Unfortunately, it seems that no one knows the passcode to this locker. Records taken from the UMBC library shows no club organizations attributed to such locker. </p>\n<p>We reached out to the Super Smash Bros club to ask for help prying the locker open. When they refused, we 1v1'd them using Corrin only on final destination. </p>\n<p>With the the smash club's efforts, we tried opening the locker. No matter how much we kicked the thing, the locker door wouldn't even dent. We suspect that the material that makes up this locker might not be of this world.</p>\n<p>Stay tuned for more updates.</p>",
            "image": "https://theultimateabsol.github.io/catacombs/media/posts/2/lockers-g848c2dfae_1920.jpg",
            "author": {
                "name": "anonymous"
            },
            "tags": [
            ],
            "date_published": "2022-06-01T02:23:00-04:00",
            "date_modified": "2022-06-21T04:46:52-04:00"
        }
    ]
}
